Обработки/Reports/_ОтчетПоАктивамВПортфеле_Атомгарант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоАктивамВПортфеле_Атомгарант</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоАктивамВПортфеле_Атомгарант/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Отчет.Период = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета) 
		И ЭтаФорма.НастройкиОтчета.Свойство("ВариантОтчета") 
		И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
		
		ЭтаФорма.КлючТекущегоВарианта = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
		
	КонецЕсли; 
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);		
	
	ИмяПредопределенного	= РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтаФорма.Отчет);
	ПредставлениеВарианта	= РаботаСОтчетамиКлиентСервер.ПолучитьПредставлениеВариантаОтчета(ЭтаФорма.Отчет);	
		
	Если ЗначениеЗаполнено(ПредставлениеВарианта) Тогда
		ЭтаФорма.Заголовок = ПредставлениеВарианта;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
		ЭтаФорма.ВариантМодифицирован = Ложь;
	КонецЕсли;
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)
	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область Автоматическое_Формирование

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);
	
	СкомпоноватьРезультат();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_Процедуры_и_Функции

&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.СчетДоверительногоУправления.Видимость 		= Отчет.ВариантФормирования = 0;
	Элементы.Клиент.Видимость 								= Отчет.ВариантФормирования = 1;
	Элементы.ВидДоговораДоверительногоУправления.Видимость 	= Отчет.ВариантФормирования = 1;
	
КонецПроцедуры

#КонецОбласти
